задачник_едт/src/Documents/ЭтапПроекта/ЭтапПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭтапПроекта</name>
  <registerRecords>AccumulationRegister.Себестоимость</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DocumentRef.Проект</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЭтапа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

задачник_едт/src/Documents/ЭтапПроекта/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Проект КАК Проект,
	|	ДанныеДокумента.НаименованиеЭтапа КАК НаименованиеЭтапа,
	|	ДанныеДокумента.ПлановаяСтоимость КАК ПлановаяСтоимость,
	|	ДанныеДокумента.ПометкаУдаления,
	|	ДанныеДокумента.Проведен,
	|	ДанныеДокумента.Номер
	|ИЗ
	|	Документ.ЭтапПроекта КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",            Реквизиты.Период);
	Запрос.УстановитьПараметр("Проект",            Реквизиты.Проект);
	Запрос.УстановитьПараметр("НаименованиеЭтапа", Реквизиты.НаименованиеЭтапа);
	Запрос.УстановитьПараметр("ПлановаяСтоимость", Реквизиты.ПлановаяСтоимость);
	Запрос.УстановитьПараметр("Номер",             Реквизиты.Номер);
	Запрос.УстановитьПараметр("ПометкаУдаления",   Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",          Реквизиты.Проведен);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Себестоимость";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Проект КАК Проект,
	|	&Ссылка КАК Этап,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СтатьяЗатрат,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.ПустаяСсылка) КАК ВидЗатрат,
	|	&ПлановаяСтоимость КАК ПлановаяСтоимость,
	|	0 КАК Себестоимость,
	|	0 КАК ДополнительныеРасходы
	|ИЗ
	|	Документ.ЭтапПроекта КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
